# vim:ft=ruby

tap "homebrew/bundle"

if OS.mac?
  tap "FelixKratz/formulae"               # For janky borders

  # taps
  brew "noti"                          # utility to display notifications from scripts
  brew "trash"                         # rm, but put in the trash rather than completely delete
  brew "borders"

  # Applications
  cask "ghostty"                       # a better terminal emulator
  cask "1password/tap/1password-cli"   # 1Password CLI
  cask "appcleaner"                    # App Cleaner
  cask "karabiner-elements"            # keyboard customizer
  cask "nikitabobko/tap/aerospace"     # a tiling window manager
  cask "gitkraken"
  cask "goland"
  cask "intellij-idea"
  cask "rustrover"
  cask "visual-studio-code"
  cask "keka"
  cask "kekaexternalhelper"
  cask "obsidian"
  cask "alt-tab"
  cask "raycast"
  cask "hiddenbar"
  cask "spotify"
  cask "zen-browser"
  cask "discord"
  cask "ubersicht"

  # Fonts
  cask "font-symbols-only-nerd-font"   # nerd-only symbols font
  cask "font-monaspace"                # Preferred monospace font
  cask "font-geist-mono-nerd-font"
  cask "font-geist-mono"
elsif OS.linux?
  brew "xclip"                         # access to clipboard (similar to pbcopy/pbpaste)
end

# Latest versions of some core utilities
brew "git"                             # Git version control
brew "vim"                             # Vim editor
brew "bash"                            # bash shell
brew "zsh"                             # zsh shell
brew "grep"                            # grep

# packages
brew "bat"                             # better cat
brew "cloc"                            # lines of code counter
brew "entr"                            # file watcher / command runner
brew "eza"                             # ls alternative
brew "fd"                              # find alternative
brew "fnm"                             # Fast Node version manager
brew "rbenv"                           # Ruby version manager
brew "fzf"                             # Fuzzy file searcher, used in scripts and in vim
brew "gh"                              # GitHub CLI
brew "git-delta"                       # a better git diff
brew "glow"                            # markdown viewer
brew "gnupg"                           # GPG
brew "highlight"                       # code syntax highlighting
brew "macmon"                            # a top alternative
brew "jq"                              # work with JSON files in shell scripts
brew "lazygit"                         # a better git UI
brew "neovim"                          # A better vim
brew "python"                          # python (latest)
brew "ripgrep"                         # very fast file searcher
brew "shellcheck"                      # diagnostics for shell sripts
brew "stylua"                          # lua code formatter
brew "tmux"                            # terminal multiplexer
brew "tree"                            # pretty-print directory contents
brew "wdiff"                           # word differences in text files
brew "wget"                            # internet file retriever
brew "zoxide"                          # switch between most used directories
brew "nvm"                             # node version manager
brew "pnpm"                            # pnpm
brew "go"                              # go
brew "rust"                            # rust
brew "git-flow"

tap "oven-sh/bun"
brew "bun"                             # bun
